import { DynContent, DynH2, DynH3, DynH4, DynP } from "../Alpha.styled";

const Public = () => {
  return (
    <DynContent>
      <DynH2>Публічний договір (Оферта)</DynH2>
      <DynH4>на замовлення, купівлю-продаж і доставку товарів</DynH4>
      <DynP>
        Цей договір є офіційною та публічною пропозицією Продавця укласти
        договір купівлі-продажу Товару, представленого на сайті SimpleShop
      </DynP>
      <DynP>
        Даний договір є публічним, тобто відповідно до статті 633 Цивільного
        кодексу України, його умови є однаковими для всіх покупців незалежно від
        їх статусу (фізична особа, юридична особа, фізична особа-підприємець)
        без надання переваги одному покупцю перед іншим. Шляхом укладення цього
        Договору Покупець в повному обсязі приймає умови та порядок оформлення
        замовлення, оплати товару, доставки товару, повернення товару,
        відповідальності за недобросовісне замовлення та всі інші умови цього
        договору. Договір вважається укладеним з моменту:
      </DynP>
      <DynP>
        натискання кнопки «Оформити Замовлення» на сторінці оформлення
        замовлення в Розділі «Кошик»
      </DynP>
      <DynP>або</DynP>
      <DynP>натискання кнопки «Купити в 1 клік»</DynP>
      <DynP>або</DynP>
      <DynP>
        створення замовлення за допомогою використання месенджерів за номерами
        телефонів, які наведені на сайті.
      </DynP>
      <DynH3>1. Визначення термінів</DynH3>
      <DynP>
        1.1. Публічна оферта (далі - «Оферта») — публічна пропозиція Продавця,
        адресована невизначеному колу осіб, укласти з Продавцем договір
        купівлі-продажу товару дистанційним способом (далі - «Договір») на
        умовах, що містяться в цій Оферті.
      </DynP>
      <DynP>
        1.2. Товар — об'єкт угоди сторін, який був обраний Покупцем на сайті
        Інтернет-магазину та поміщений у кошик, або вже придбаний Покупцем у
        Продавця дистанційним способом.
      </DynP>
      <DynP>
        1.3. Інтернет-магазин — сайт Продавця за адресою www.perchinka.ua
        створений для укладення договорів роздрібної та оптової купівлі-продажу
        на підставі ознайомлення Покупця із запропонованим Продавцем описом
        Товару за допомогою мережі Інтернет.
      </DynP>
      <DynP>
        1.4. Покупець — дієздатна фізична особа, яка досягла 18 років, отримує
        інформацію від Продавця, розміщує замовлення щодо купівлі товару, що
        представлений на сайті Інтернет-магазину або юридична особа чи фізична
        особа-підприємець.
      </DynP>
      <DynP>
        1.5. Продавець — організація, незалежно від її організаційно-правової
        форми та/або фізична особа підприємець, який здійснює продаж товару.
      </DynP>
      <DynH3>2. Предмет Договору</DynH3>
      <DynP>
        2.1. Продавець зобов’язується передати у власність Покупцю Товар, а
        Покупець зобов’язується оплатити і прийняти Товар на умовах цього
        Договору.
      </DynP>
      <DynP>
        2.2. Датою укладення Договору-оферти (акцептом оферти) та моментом
        повного й беззаперечного прийняття Покупцем умов Договору вважається
        дата заповнення Покупцем форми замовлення, розташованої на сайті
        Інтернет-магазину, за умови отримання Покупцем від Продавця
        підтвердження замовлення в електронному вигляді.
      </DynP>
      <DynH3>3. Оформлення Замовлення</DynH3>
      <DynP>
        3.1. Покупець самостійно оформляє замовлення в Інтернет-магазині через
        форму «Кошика», або зробивши замовлення електронною поштою чи за номером
        телефону, вказаним в розділі контактів Інтернет-магазину.
      </DynP>
      <DynP>
        3.2. Продавець має право відмовитися від передання замовлення Покупцеві
        у випадку, якщо відомості, вказані Покупцем під час оформлення
        замовлення, є неповними або викликають підозру щодо їх дійсності.
      </DynP>
      <DynP>
        3.3. При оформленні замовлення на сайті Інтернет-магазину Покупець
        зобов'язується надати наступну обов’язкову інформацію, необхідну
        Продавцю для виконання замовлення:
      </DynP>
      <DynP>3.3.1. прізвище, ім'я Покупця;</DynP>
      <DynP>
        3.3.2. адреса, за якою слід доставити Товар (якщо доставка до адреси
        Покупця);
      </DynP>
      <DynP>3.3.3. контактний телефон;</DynP>
      <DynP>
        3.3.4. Ідентифікаційний код для юридичної особи або фізичної-особи
        підприємця.
      </DynP>
      <DynP>
        3.4. Найменування, кількість, артикул, ціна обраного Покупцем Товару
        вказуються в кошику Покупця на сайті Інтернет-магазину.
      </DynP>
      <DynP>
        3.5. Якщо будь-якій із Сторін договору необхідна додаткова інформація,
        вона має право запросити її у іншої Сторони. У разі ненадання необхідної
        інформації Покупцем, Продавець не несе відповідальності за надання
        якісної послуги Покупцю при покупці товару в інтернет-магазині.
      </DynP>
      <DynP>
        3.6. При оформленні замовлення через оператора Продавця (п. 3.1. Цієї
        Оферти) Покупець зобов'язується надати інформацію, зазначену в п. 3.3 –
        3.4. цієї Оферти.
      </DynP>
      <DynP>
        3.7. Ухвалення Покупцем умов цієї Оферти здійснюється за допомогою
        внесення Покупцем відповідних даних в реєстраційну форму на сайті
        Інтернет-магазину або при оформленні Замовлення через оператора. Після
        оформлення Замовлення через Оператора дані про Покупця вносяться до бази
        даних Продавця.
      </DynP>
      <DynP>
        3.8. Покупець несе відповідальність за достовірність наданої інформації
        при оформленні Замовлення.
      </DynP>
      <DynP>
        3.9. Укладаючи Договір, тобто приймаючи умови даної пропозиції
        (запропоновані умови придбання Товару), шляхом оформлення Замовлення,
        Покупець підтверджує наступне:
      </DynP>
      <DynP>
        а) Покупець цілком і повністю ознайомлений, і згоден з умовами цієї
        пропозиції (оферти);
      </DynP>
      <DynP>
        б) він дає дозвіл на збір, обробку та передачу персональних даних,
        дозвіл на обробку персональних даних діє протягом усього терміну дії
        Договору, а також протягом необмеженого терміну після закінчення його
        дії. Крім цього, укладенням договору Покупець підтверджує, що він
        повідомлений (без додаткового повідомлення) про права, встановлених
        Законом України "Про захист персональних даних", про цілі збору даних, а
        також про те, що його персональні дані передаються Продавцю з метою
        можливості виконання умов цього Договору, можливості проведення
        взаєморозрахунків, а також для отримання рахунків, актів та інших
        документів. Покупець також погоджується з тим, що Продавець має право
        надавати доступ та передавати його персональні дані третім особам без
        будь-яких додаткових повідомлень Покупця з метою виконання замовлення
        Покупця. Обсяг прав Покупця, як суб'єкта персональних даних відповідно
        до Закону України "Про захист персональних даних" йому відомий і
        зрозумілий.
      </DynP>
      <DynH3>4. Ціна і Доставка Товару</DynH3>
      <DynP>
        4.1 Ціни на Товари та послуги визначаються Продавцем самостійно та
        вказані на сайті Інтернет-магазину. Всі ціни на Товари та послуги
        вказані на сайті у гривнях з урахуванням ПДВ.
      </DynP>
      <DynP>
        4.2 Ціни на Товари та послуги можуть змінюватися Продавцем в
        односторонньому порядку залежно від кон'юнктури ринку. При цьому ціна
        окремої одиниці Товару, вартість якої оплачена Покупцем в повному
        обсязі, не може бути змінена Продавцем в односторонньому порядку.
      </DynP>
      <DynP>
        4.3. Вартість Товару, яка вказана на сайті Інтернет-магазину не включає
        в себе вартість доставки Товару Покупцю. Вартість доставки Товару
        Покупець сплачує відповідно до діючих тарифів служб доставки
        (перевізників) безпосередньо обраній ним службі доставки (перевізнику).
      </DynP>
      <DynP>
        4.4. Вартість Товару яка вказана на сайті Інтернет-магазину не включає в
        себе вартість доставки Товару на адресу Покупця.
      </DynP>
      <DynP>
        4.5. Продавець може вказати орієнтовну вартість доставки Товару на
        адресу Покупця під час звернення Покупця із відповідним запитом до
        Продавця шляхом надіслання листа на електронну пошту або при оформленні
        замовлення через оператора інтернет-магазину.
      </DynP>
      <DynP>
        4.6. Зобов'язання Покупця по оплаті Товару вважаються виконаними з
        моменту надходження Продавцю коштів на його рахунок.
      </DynP>
      <DynP>
        4.7. Розрахунки між Продавцем і Покупцем за Товар здійснюються
        способами, зазначеними на сайті Інтернет-магазину в розділі «Оплата».
      </DynP>
      <DynP>
        4.8. При отриманні товару Покупець зобов'язується перевірити
        відповідність Товару якісним і кількісним характеристикам (найменування
        товару, кількість, комплектність, термін придатності).
      </DynP>
      <DynP>
        4.9. Покупець або його представник під час приймання Товару підтверджує
        своїм підписом в товарному чеку/ або в замовленні/ або в транспортній
        накладній на доставку товарів, що не має претензій до кількості товару,
        зовнішнім виглядом і комплектності Товару.
      </DynP>
      <DynP>
        4.10. Право власності та ризик випадкової втрати або пошкодження Товару
        переходить до Покупця або його Представника з моменту отримання Товару
        Покупцем в місці поставки Товару при самостійній доставці Товару від
        Продавця, чи під час передачі Продавцем товару службі доставки
        (перевізнику) обраної Покупцем.
      </DynP>
      <DynP>
        4.11. Доставка товару зі способом оплати "Післяплата" (накладного
        платежу) здійснюється на умовах його зберігання у перевізника протягом 5
        календарних днів з дня прибуття товару у обране Покупцем місце для його
        отримання. Після спливу цього строку, за умови, не отримання Покупцем
        товару, Інтернет-магазин зберігає за собою право здійснити повернення
        такого Товару в односторонньому порядку.
      </DynP>
      <DynP>
        4.12. Графік виконання та доставки замовлень розміщується на сайті
        Інтернет-магазину у розділі «Оплата та Доставка».
      </DynP>
      <DynH3>5. Права та обов'язки Сторін</DynH3>
      <DynP>5.1. Продавець зобов’язаний:</DynP>
      <DynP>
        5.1.1. Передати Покупцеві товар у відповідності до умов цього Договору
        та замовлення Покупця.
      </DynP>
      <DynP>
        5.1.2. Не розголошувати будь-яку приватну інформацію про Покупця і не
        надавати доступ до цієї інформації третім особам, за винятком випадків,
        передбачених законодавством та під час виконання Замовлення Покупця.
      </DynP>
      <DynP>5.2. Продавець має право:</DynP>
      <DynP>
        5.2.1. Змінювати умови цього Договору, а також ціни на Товари та
        послуги, в односторонньому порядку, розміщуючи їх на сайті
        Інтернет-магазину. Всі зміни набувають чинності з моменту їх публікації.
      </DynP>
      <DynP>5.3. Покупець зобов'язується:</DynP>
      <DynP>
        5.3.1. До моменту укладення Договору ознайомитися зі змістом Договору,
        умовами Договору і цінами, запропонованими Продавцем на сайті
        Інтернет-магазину.
      </DynP>
      <DynP>
        5.3.2. На виконання Продавцем своїх зобов'язань перед Покупцем останній
        повинен повідомити всі необхідні дані, що однозначно ідентифікують його
        як Покупця, і достатні для доставки Покупцеві замовленого Товару.
      </DynP>
      <DynP>
        5.3.3. Покупець зобов'язується отримати товар у перевізника протягом 5
        календарних днів з дня прибуття Товару у обране Покупцем місце для його
        отримання.
      </DynP>
      <DynH3>6. Повернення Товару</DynH3>
      <DynP>
        6.1. Покупець погоджується та приймає умови та порядок здійснення
        гарантії та повернення Товару, розміщені на сайті інтернет-магазину, які
        знаходяться за посиланням
      </DynP>
      <DynH3>7. Відповідальність</DynH3>
      <DynP>
        7.1. Продавець не несе відповідальності за шкоду, заподіяну Покупцеві
        або третім особам внаслідок неналежного монтажу, використання,
        зберігання Товару придбаного у Продавця.
      </DynP>
      <DynP>
        7.2. Продавець не несе відповідальності за неналежне, несвоєчасне
        виконання Замовлень і своїх зобов’язань у випадку надання Покупцем
        недостовірної або помилкової інформації.
      </DynP>
      <DynP>
        7.3. Продавець і Покупець несуть відповідальність за виконання своїх
        зобов'язань відповідно до чинного законодавства України і положень цього
        Договору.
      </DynP>
      <DynP>
        7.4. Продавець або Покупець звільняються від відповідальності за повне
        або часткове невиконання своїх зобов'язань, якщо невиконання є наслідком
        форс-мажорних обставин як: війна або військові дії, землетрус, повінь,
        пожежа та інші стихійні лиха, що виникли незалежно від волі Продавця і /
        або Покупця після укладення цього договору. Сторона, яка не може
        виконати свої зобов'язання, негайно повідомляє про це іншу Сторону.
      </DynP>
      <DynH3>8. Конфіденційність і захист персональних даних</DynH3>
      <DynP>
        8.1. Надаючи свої персональні дані на сайті Інтернет-магазину при
        реєстрації або оформленні Замовлення, Покупець надає Продавцеві свою
        добровільну згоду на обробку, використання (у тому числі і передачу)
        своїх персональних даних, а також вчинення інших дій, передбачених
        Законом України «Про захист персональних даних», без обмеження терміну
        дії такої згоди.
      </DynP>
      <DynP>
        8.2. Продавець зобов'язується не розголошувати отриману від Покупця
        інформацію. Не вважається порушенням надання Продавцем інформації
        контрагентам і третім особам, що діють на підставі договору з Продавцем,
        в тому числі і для виконання зобов'язань перед Покупцем, а також у
        випадках, коли розкриття такої інформації встановлено вимогами чинного
        законодавства України.
      </DynP>
      <DynP>
        8.3. Покупець несе відповідальність за підтримання своїх персональних
        даних в актуальному стані. Продавець не несе відповідальності за
        неякісне виконання або невиконання своїх зобов'язань у зв'язку з
        неактуальністю інформації про Покупця або невідповідністю її дійсності.
      </DynP>
      <DynH3>9. Інтелектуальна власність авторські права</DynH3>
      <DynP>
        9.1. Продавець є єдиним власником торгової марки SimpleShop, згідно
        Свідоцтва України № 253882 від 11 лютого 2019 року.
      </DynP>
      <DynP>
        9.2. Пунктом 2,4 статті 16 Закону України "Про охорону прав на знаки для
        товарів і послуг» встановлено, що свідоцтво надає його власнику право
        використовувати знак та інші права, визначені цим Законом.
      </DynP>
      <DynP>
        9.3. Згідно ст. 20 Закону України "Про охорону прав на знаки для товарів
        і послуг" будь-яке посягання на права власника свідоцтва, передбачені
        ст. 16 цього Закону, в тому числі вчинення без згоди власника свідоцтва
        дій, що потребують його згоди, та готування до вчинення таких дій,
        вважається порушенням прав власника свідоцтва, що тягне за собою
        відповідальність згідно чинного законодавства України.
      </DynP>
      <DynP>
        9.4. Порушенням прав власника свідоцтва вважається також використання
        без його згоди в доменних іменах, знаків і позначень, зазначених у п.5
        ст. 16 цього Закону.
      </DynP>
      <DynP>
        9.5. Для законного використання ТМ - нанесення його на будь-який товар,
        для якого зареєстрований знак, упаковку, в якій міститься такий Товар,
        вивіску, етикетку, нашивку, бирку або інший прикріплений до товару
        предмет, зберігання такого товару з нанесеним зазначеним знаком для
        продажу, пропозиція його для продажу, продаж, імпорт (ввезення) та
        експорт (вивезення), застосування його в діловій документації або в
        рекламі, і в мережі Інтернет, в тому числі в доменних іменах, потрібно
        отримати окремий дозвіл власника такого знаку.
      </DynP>
      <DynP>
        9.6. Якщо суб'єкти підприємницької діяльності виявили бажання
        використовувати ТМ у своїй діяльності, за дозволом на її використання,
        вони можуть звернутися з листом на електронну адресу вказану у розділі
        «Контакти».
      </DynP>
      <DynP>
        9.7. Продавець є власником виняткових майнових авторських прав на ряд
        фотографічних творів, графічних зображень на сайті і є їх єдиним
        автором. Продавець використовує фотографічні твори шляхом публікації на
        сайті Інтернет-магазину для ілюстрації товарів і послуг.
      </DynP>
      <DynP>
        9.8. В силу презумпції оригінальності об'єктів авторського права, всі
        фотографічні твори є оригінальними, тому охороняються авторським правом
        без реєстрацій і формальностей з моменту їх створення в усіх країнах
        світу згідно «Бернської конвенції про охорону літературних і художніх
        творів» 1886 року, і Законом України «Про авторське право і суміжні
        права» 1993 року.
      </DynP>
      <DynP>
        9.9. Суб'єкт виключних майнових авторських прав на фотографічні твори
        може давати дозвіл на використання цих творів третім особам і заборонити
        їх використання, якщо таке має місце без отримання дозволу. Власник
        фото, розміщених на сайті Інтернет-магазину дає дозвіл на використання
        його фото тільки в тому випадку, коли у фото буде розміщено зворотнє
        посилання на першоджерело.
      </DynP>
      <DynP>
        9.10. Якщо іншими авторами було виявлено розміщення їх фото-творів на
        сайті Інтернет-магазину, всі претензії приймаються за адресою вказаною у
        розділі «Контакти».
      </DynP>
      <DynH3>10. Інші умови</DynH3>
      <DynP>
        10.1. Цей договір укладено на території України і діє відповідно до
        чинного законодавства України.
      </DynP>
      <DynP>
        10.2. Усі спори, що виникають між Покупцем і Продавцем, вирішуються
        шляхом переговорів. У випадку недосягнення врегулювання спірного питання
        шляхом переговорів, Покупець та/або Продавець мають право звернутися за
        вирішенням спору до судових органів відповідно до чинного законодавства
        України.
      </DynP>
      <DynP>
        10.3. Продавець має право вносити зміни до цього Договору в
        односторонньому порядку, передбаченому п. 5.2.1. Договору. Крім того,
        зміни до Договору також можуть бути внесені за взаємною згодою Сторін в
        порядку, передбаченому чинним законодавством України.
      </DynP>
      <DynP>
        10.4. Доступ до сайту www.perchinka.ua дозволено лише повнолітнім
        особам, а тому використовуючи вказаний ресурс, користувач погоджується
        та підтверджує, що йому виповнилося 18 років.
      </DynP>
      <DynP>
        10.5. Відповідальність за зміст коментарів, висловлювань або іншого
        контенту, який розміщується не власниками або адміністрацією сайту, несе
        особа, яка є його автором.
      </DynP>
      <DynP>
        10.6. Адміністрація сайту, залишає за собою право відмовитися від
        виконання замовлення у випадку його неоплати на визначених сторонами
        умовах протягом визначеного сторонами терміну.
      </DynP>
      <DynP>
        10.7. Адміністрація сайту, залишає за собою право відмовитися від
        виконання замовлення з післяоплатою (накладний платіж) в односторонньому
        порядку.
      </DynP>
      <DynP>
        10.8. Приймаючи умови цього Договору, Сторони підтверджують те, що вони
        ознайомлені з вимогами Закону України “Про захист персональних даних”,
        дають згоду (дозвіл) на обробку їх персональних даних, а також
        підтверджують їх повноту і правильність.
      </DynP>
      <DynP>
        Сторони зобов'язуються нести відповідальність за правильність та зміст
        наданих даних, а також їх повноту і достовірність.
      </DynP>
      <DynP>
        В разі надання завідомо неправдивих даних або використання даних інших
        осіб, відповідальність за таке їх використання, покладається на особу,
        яка їх надала.
      </DynP>
      <DynP>
        10.9. Покупець приймає та зобов'язується дотримуватися умов та правил
        використання окремих сервісів та послуг («кешбек», «подарункові онлайн
        сертифікати», «програма лояльності» та ін.), інформація про які
        розміщена на сайті інтернет-магазину.
      </DynP>
      <DynP>
        10.10. Цей договір викладено українською мовою. викладена для зручності
        користувачів та не є оригінальним текстом Договору. У випадку
        розбіжностей між версіями, перевага повинна надаватися тексту,
        викладеному українською мовою.
      </DynP>
    </DynContent>
  );
};
export default Public;
