import { DynContent, DynH2, DynH3, DynH4, DynLi, DynP, DynUl } from "../Alpha.styled";

const LoyaltyProgram = () => {
  return (
    <DynContent>
      <DynH2>Програма лояльності</DynH2>
      <DynP>
        SimpleShop дуже любить своїх клієнтів і ми віримо, що ця любов взаємна. А
        в справжніх і міцних відносинах повинні траплятись несподівані і приємні
        сюрпризи, сміх і радість, почуття турботи. З цією думкою ми і розробили
        нашу програму 14-smiDynLing-face-with-hearts.svg
      </DynP>
      <DynP>
        Купувати улюблені товари в секс шопі SimpleShop - це завжди вигідно. Ми
        щосили намагаємося утримувати максимально демократичні ціни для наших
        улюблених відвідувачів. Окрім цього, у нашому магазині постійно діють
        чесні знижки на десятки різноманітних товарів.
      </DynP>
      <DynH4>Чому ми називаємо їх "чесними", запитаєте ви?</DynH4>
      <DynP>
        - Все дуже просто. Перед тим, як перекреслити цінник і зробити знижку,
        ми не підвищуємо початкову ціну. Все по чесному!
      </DynP>
      <DynH4>Як знайти секс іграшки зі знижками?</DynH4>
      <DynP>
        Такі пропозиції постійно траплятимуться Вам під час перегляду каталогу.
        А ще у нас є сторінка Розпродаж, куди потрапляють всі товари зі
        знижками. Завдяки зручним фільтрам Ви зможете відсіятиті товари, що вас
        не цікавлять, і сконцентруватися на необхідному.
      </DynP>
      <DynH4>А якщо на товар, який я хочу придбати, немає знижки?</DynH4>
      <DynP>У цьому випадку SimpleShop нарахує Вам кешбек. 40-partying-face.svg</DynP>
      <DynH3>Кешбек</DynH3>
      <DynP>
        Кешбек – це бонус, який повертається у вигляді % від суми придбаного
        товару на ваш баланс в особистому кабінеті SimpleShop. Він нараховується
        лише за товари, придбані без знижки. Кешбек стає активним через 14 днів
        після того, як ви заберете ваше замовлення зі складу перевізника. Термін
        дії кешбеку – 6 місяців з дня його активації. Їм можна сплатити до 40%
        вартості Вашого наступного замовлення.
      </DynP>
      <DynH3>Рівні лояльності</DynH3>
      <DynP>
        За досягнення нового рівня Ви отримуватимете різні подарунки,
        відкриватимуться нові функції та можливості використання сайту, а кешбек
        буде дедалі більше. Усього існує 4 рівні лояльності:
      </DynP>
      <DynUl>
        <DynLi>Еквівалент рівня</DynLi>
        <DynLi>Жіночі ранги</DynLi>
        <DynLi>Чоловічі ранги</DynLi>
        <DynLi>Переваги</DynLi>
        <DynLi>Новачок</DynLi>
        <DynLi>Руйнівниця сердець</DynLi>
        <DynLi>Фаворит дівочих вподобань</DynLi>
        <DynLi>
          <DynUl>
            <DynLi>Кешбек 2%</DynLi>
            <DynLi>Подарунки при замовленнях від 2000 ₴</DynLi>
          </DynUl>
        </DynLi>
        <DynLi>Любитель</DynLi>
        <DynLi>Крутіша ніж Кім</DynLi>
        <DynLi>Крутіший Казанови</DynLi>
        <DynLi>
          <DynUl>
            <DynLi>Кешбек 3%</DynLi>
            <DynLi>Подарунки при замовленнях 2000 ₴</DynLi>
            <DynLi>Подарунки від SimpleShop до Дня народження</DynLi>
            <DynLi>Подарунок за досягнення рівня 100 ₴ на кешбек баланс</DynLi>
            <DynLi>
              Кнопка в кошику "Не передзвонювати для підтвердження замовлення"
            </DynLi>
            <DynLi>Миттєва публікація відгуків (не чекаючи модерації)</DynLi>
          </DynUl>
        </DynLi>
        <DynLi>Профі</DynLi>
        <DynLi>SimpleShop спокусниця</DynLi>
        <DynLi>Майстер Пікапу</DynLi>
        <DynLi>
          <DynUl>
            <DynLi>Кешбек 4%</DynLi>
            <DynLi>
              Відправляємо фірмовий кухоль "SimpleShop спокусниця" або "Майстер
              Пікапу"
            </DynLi>
            <DynLi>Подарунки при замовленнях 2000 ₴</DynLi>
            <DynLi>Подарунки від SimpleShop до Дня народження</DynLi>
            <DynLi>Подарунок за досягнення рівня 300 ₴ на кешбек баланс</DynLi>
            <DynLi>
              Кнопка в кошику "Не передзвонювати для підтвердження замовлення"
            </DynLi>
            <DynLi>Миттєва публікація відгуків (не чекаючи модерації)</DynLi>
          </DynUl>
        </DynLi>
        <DynLi>Експерт</DynLi>
        <DynLi>Богиня кохання</DynLi>
        <DynLi>Небезпечний, сексуальний</DynLi>
        <DynLi>
          <DynUl>
            <DynLi>Кешбек 5%</DynLi>
            <DynLi>
              Відправляємо фірмовий кухоль "Богиня кохання" або "Небезпечний,
              сексуальний"
            </DynLi>
            <DynLi>Подарунки при замовленнях 2000 ₴</DynLi>
            <DynLi>Подарунки від SimpleShop до Дня народження</DynLi>
            <DynLi>Подарунок за досягнення рівня 500 ₴ на кешбек баланс</DynLi>
            <DynLi>
              Кнопка в кошику "Не передзвонювати для підтвердження замовлення"
            </DynLi>
            <DynLi>Миттєва публікація відгуків (не чекаючи модерації)</DynLi>
          </DynUl>
        </DynLi>
      </DynUl>
      <DynH3>Наша турбота</DynH3>
      <DynP>
        Незалежно від рівня лояльності, будь то Ваша чергова покупка або перша,
        Ви завжди можете бути впевнені у високій якості обслуговування, щирої
        допомоги та професійної консультації, а також у повній конфіденційності
        замовлення та вказаних персональних даних. Детальніше про анонімність
        можна прочитати тут: Наші гарантії
      </DynP>
      <DynP>
        Залишаючи публічний відгук на сайті або питання про товар, всі інші
        відвідувачі бачитимуть лише Ваше ім'я та ранг. Прізвище не
        відображатиметься для збереження конфіденційності.
      </DynP>
      <DynP>
        Ми прикладаємо максимум зусиль, щоб разом із покупкою доставляти вам
        найтепліші та найприємніші емоції!
      </DynP>
      <DynP>Дякуємо, що обираєте SimpleShop і за те, що робите нас краще!</DynP>
      <DynP>Залишайтеся з нами, ми не підкачаємо 39-cowboy-hat-face.svg</DynP>
    </DynContent>
  );
};
export default LoyaltyProgram;
