import {
  DynContent,
  DynH2,
  DynH3,
  DynLi,
  DynP,
  DynPCenter,
  DynUl,
} from "../Alpha.styled";

const ProductReturn = () => {
  return (
    <DynContent>
      <DynH2>Гарантія та повернення товару</DynH2>
      <DynP>
        <DynPCenter>
          SimpleShop надає гарантію на відсутність в товарі заводських дефектів
          абсолютно
        </DynPCenter>
        <DynPCenter>на всю продукцію в магазині.</DynPCenter>
        <DynPCenter>
          Також, в нашому асортименті присутні товари з довгостроковою гарантією
          на 1 рік або більше.
        </DynPCenter>
        <DynPCenter>Далі про все детально.</DynPCenter>
      </DynP>
      <DynH3>Обмін товару з виробничим браком або дефектом</DynH3>
      <DynP>
        При отриманні товару обов'язково ознайомтеся з його цілісністю і
        працездатністю. Це не обов'язково робити прямо біля кур'єра або
        співробітника пошти. Сміливо забирайте посилку і перевіряйте її в
        комфортній атмосфері. Головне - проведіть перевірку в день отримання
        товару, а в разі виявлення дефекту повідомте про це нам протягом 24
        годин з моменту його отримання.
      </DynP>
      <DynH3>Правила обміну товару з виробничим браком або дефектом</DynH3>
      <DynP>
        Якщо в ході перевірки, Ви виявили, що придбаний товар має виробничий
        брак або дефект, не варто переживати! Ми замінимо бракований товар на
        новий, при цьому ми покриваємо витрати за пересилку в обидві сторони.
      </DynP>
      <DynP>
        Потрібно повертати чистий товар, який не був у використанні, в його
        оригінальній фірмовій упаковці, в тій же комплектації, в якій Ви його
        отримали (зарядний кабель, інструкція, тощо).
      </DynP>
      <DynP>
        Після отримання товару ми проводимо його діагностику задіюючи
        відеозйомку починаючи з розпакування посилки з потенційно дефектним
        товаром.
      </DynP>
      <DynH3>При підтвердженні виробничого браку</DynH3>
      <DynP>
        Ми відправляємо Вам на заміну новий товар. На практиці це займає 1-2 дні
        з моменту його отримання. Але формально, ми залишаємо за собою право
        провести заміну не пізніше 14-ти днів від дати отримання товару.
      </DynP>

      <DynP>
        Витрати за послуги транспортної компанії по обміну товару в обидві
        сторони ми беремо на себе.
      </DynP>

      <DynH3>Якщо виробничий брак не підтверджується</DynH3>
      <DynP>
        Ми повідомляємо про це Вам, а при необхідності відправляємо відео
        діагностики з доказами. У цьому випадку витрати за пересилку товару
        лягають на покупця. Товар буде відправлений Вам назад по вартості його
        доставки.
      </DynP>
      <DynH3>Як заявити про несправність виробу</DynH3>
      <DynP>
        Перш за все, рекомендуємо прочитати найпопулярніші причини чому секс
        іграшка не працює, в більшості випадків проблема криється саме в них.
        Якщо після виконання цих дій іграшка не запрацювала, заявіть нам про
        несправність.
      </DynP>
      <DynP>
        Для цього просто зателефонуйте нам в робочий час за телефонами вказаними
        внизу сторінки або зробіть це онлайн за допомогою форми нижче:
      </DynP>
      <DynH3>Обмін товару належної якості</DynH3>
      <DynP>
        Предмети особистої гігієни належної якості не підлягають поверненню або
        обміну відповідно до постанови Кабінету Міністрів України № 172 від
        19.03.1994р. Перелік товарів, які не підлягають поверненню або обміну:
      </DynP>
      <DynUl>
        <DynLi>корсетні товари;</DynLi>
        <DynLi>натільна і постільна білизна;</DynLi>
        <DynLi>панчішно-шкарпеткові вироби;</DynLi>
        <DynLi>пір’яні та пухові вироби;</DynLi>
        <DynLi>рукавиці;</DynLi>
        <DynLi>розчіски, гребінці, масажні щітки;</DynLi>
        <DynLi>товари в аерозольній упаковці;</DynLi>
        <DynLi>парфюмерно-косметичні вироби;</DynLi>
        <DynLi>лікарські препарати і засоби;</DynLi>
        <DynLi>
          предмети особистої гігієни і товари, що дотикаються до інтимних частин
          тіла та слизових.
        </DynLi>
      </DynUl>
    </DynContent>
  );
};
export default ProductReturn;
