import { DynContent, DynH2, DynLi, DynP, DynUl } from "../Alpha.styled";

const Cooperation = () => {
  return (
    <DynContent>
      <DynH2>SimpleShop Business</DynH2>
      <DynP>
        У концепції ведення бізнесу B2B ми дотримуємось тих же основних
        принципів, що і в роздрібній торгівлі. Це - взаємна довіра, небайдужість
        та турбота. Якщо Ви власник секс шопу і шукаєте постачальника секс
        іграшок та периферії для оптових закупівель у свій магазин, тому що Ви
        хочете:
      </DynP>
      <DynUl>
        <DynLi>Тішити клієнтів свого магазину високоякісними товарами;</DynLi>
        <DynLi>
          Прискорити процес обслуговування та обробки замовлень за рахунок
          стабільної наявності стоку;
        </DynLi>
        <DynLi>
          берегти чесно зароблену репутацію Вашої компанії, співпрацюючи з
          виключно надійними партнерами;
        </DynLi>
        <DynLi>Забезпечити зростання та розвиток свого бізнесу.</DynLi>
      </DynUl>
      <DynP>
        Тоді за допомогою взаємовигідного та продуктивного партнерства Ви
        закладете міцний фундамент для зведення поставлених цілей!
      </DynP>
    </DynContent>
  );
};
export default Cooperation;
